[
   {
      "id":5,
      "date":"2020-03-26T23:13:21",
      "date_gmt":"2020-03-26T23:13:21",
      "guid":{
         "rendered":"https:\/\/eliashami.com\/\/?p=5"
      },
      "modified":"2020-09-03T19:59:45",
      "modified_gmt":"2020-09-03T19:59:45",
      "slug":"what-is-web-development",
      "status":"publish",
      "type":"post",
      "link":"https:\/\/eliashami.com\/what-is-web-development\/",
      "title":{
         "rendered":"What is web development ?"
      },
      "content":{
         "rendered":"\r\n<p>Hello world, my name is Elias, i&#8217;m passionate about web development and science. I decided to create this blog to share some cool project that I did or will do. In this first post we will try to understand what&#8217;s the web to know that basics before jumping to making coding projects.<\/p>\r\n\r\n\r\n\r\n<h4>The basics<\/h4>\r\n\r\n\r\n\r\n<ul><li>The <em>World Wide Web<\/em> is a system of  interconnected <strong>web pages <\/strong>accessible through the <strong>Internet<\/strong><\/li><li> A <em>web page<\/em> is a <strong>web ressource<\/strong> used by <strong>web browsers<\/strong> to display content fetched from <strong>web servers<\/strong>. It consists of <strong>HTML <\/strong>documents for the structure, <strong>CSS <\/strong>files for the presentation and <strong>Javascript <\/strong>files for the interactiveness. A web site is a group of web pages linked by <strong>hyperlinks<\/strong><\/li><li> The <em>Internet<\/em> is a network of communicating computers identified by IP adresses. The web is one of many applications of the internet<\/li><li> A <em>web ressource<\/em> is anything that is manipulated, stored, sent, &#8230; over the web. For example web pages, images, datas, &#8230; <\/li><li> A <em>Web server<\/em> is program installed in a server (a computer that serve content) that listens to requests from clients and send web ressources using <strong>HTTP<\/strong><\/li><li>A <em>Web browser<\/em> is a program installed in a client (a computer that consume content) that request and receive web ressources to use them <\/li><li> <em>HTML<\/em> (HyperText Markup Langage) is a markup language used for structuring a web page. Web browsers read through HTML documents to know what to display. HTML is an implementation of the concept of <strong>hypertext<\/strong><\/li><li><em>Hypertexts<\/em> are documents that are inter-connected by hyperlinks. They are non-linear texts because you can go from one text to another by  following the links<\/li><li><em>Hyperlinks<\/em> or <em>links<\/em> are texts that contain an <strong>URL <\/strong>and are placed in hypertext documents to redirect to other hypertexts<\/li><li><em>URL (Uniform Ressource Locator)<\/em> also called web adress, is what identifies a ressource on the web and is used to fetch it <\/li><li><em>CSS (Cascading Style Sheets) <\/em>is a language used to style a HTML document<\/li><li><em>Javascript<\/em> is a scripting language used to dynamically modify a HTML Document<\/li><li><em>HTTP (HyperText Transfer Protocol)<\/em> is a protocol to transfer web ressources trough the internet<\/li><\/ul>\r\n\r\n\r\n\r\n<p>Here is a concept map of all technologies described above :<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1014\" height=\"1155\" src=\"https:\/\/eliashami.com\/wp-content\/uploads\/2020\/03\/Web-concept-map-Page-1.svg\" alt=\"Web concept map\" class=\"wp-image-48\"\/><figcaption>Concept map of the WWW<\/figcaption><\/figure>\r\n\r\n\r\n\r\n<p>In next chapter we will see how web ressources are fetched.<\/p>\r\n\r\n\r\n\r\n<h4>How to fetch web ressources ?<\/h4>\r\n\r\n\r\n\r\n<p class=\"has-text-align-left\">When a client requests a web ressource, it needs to know the IP adress of server where the ressource is stored. First the given URL is parsed URL to obtain a protocol, a domain name and a path. <\/p>\r\n\r\n\r\n\r\n<p class=\"has-text-align-left\">For example : <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Learn\/HTML\">https:\/\/developer.mozilla.org\/en-US\/docs\/Learn\/HTML<\/a>, the protocol is <strong>https<\/strong> which is a crypted version of http, <strong>developer.mozilla.org<\/strong> is the domain name and <strong>en-US\/docs\/Learn\/HTML<\/strong> is the path which is tells &#8220;where&#8221; on the server the ressource is stored. <\/p>\r\n\r\n\r\n\r\n<p class=\"has-text-align-left\">Second the domain is sent to a specific server called a DNS server which IP adress is know by the client&#8217;s operating system. The DNS (Domain Name Service) in short, is just a big dictionnary of domains mapped to IP adresses. So the DNS send back the IP adress of the server that the client needs to request the web ressource. <\/p>\r\n\r\n\r\n\r\n<p class=\"has-text-align-left\">Second a HTTP(s) request is generated and sent by the client. It contains a header that gives informations to the server about the request itself and the content. Then depending on the request type it may contain a body which is the content of the request. The server receive and &#8220;understand&#8221; the request and will then send back the ressource in a HTTP(s) request in the other way which is seen from the client as a response. The principles of HTTP is described <a href=\"https:\/\/wikipedia.org\/wiki\/Hypertext_Transfer_Protocol\">here<\/a>.<\/p>\r\n\r\n\r\n\r\n<p>Of course HTTP is not the only protocol used to transfer data through the internet but we will not go in depth in the understanding of how the protocols and the internet network works or even how a computer works. As soon as you have computers connected to internet you don&#8217;t have to worry about it as a web developper. It&#8217;s the role of network engineers or computer scientists that figure out ways optimize the speed of connection or the speed of calculation.<\/p>\r\n\r\n\r\n\r\n<p>As described above a web ressources could be anything that is resqueted in the web not only web pages. In the next chapter we will see what are APIs. <\/p>\r\n\r\n\r\n\r\n<h4>APIs<\/h4>\r\n\r\n\r\n\r\n<p>We saw that in the case of fetching web pages the point is to display something to a user. Sometimes it&#8217;s not a user that need the informations but a computer program in the client side. This program don&#8217;t need the information to be humanly readable as it can process raw data. There are different ways to organize data, JSON and XML are the most common. HTML also organizes data but only for the browser to display a web page to the user.<br>When computers &#8220;talk&#8221; to computers they can use different &#8220;languages&#8221; and can miss understand each other just like humans. So we need a standardized way to exchange data between computers. This new kind of protocol is called an API (Application Programming Interface). You can sometimes hear the word web service which is just a specific word used for APIs in the web, meaning that the computers are communicating through the web. APIs don&#8217;t necessarily use the web. We will keep the word API which more general. The most used type of architecture for building APIs in the web is REST (Representational state transfer) Architecture which is described <a href=\"https:\/\/wikipedia.org\/wiki\/Representational_state_transfer\">here<\/a>.<\/p>\r\n\r\n\r\n\r\n<p>Now that we know how to fetch web pages and data with APIs we can use this knowledge to build web applications.<\/p>\r\n\r\n\r\n\r\n<h4>Technics to make a web application<\/h4>\r\n\r\n\r\n\r\n<p>Web developpers need to worry about making great web applications. The difference between a web site and a web application is that web application are much more interactive and provide the user the capability to control what he sees. Websites are so simple that, now days there are tools called CMS (Content Management System) like WordPress, that let you quickly build a web site without any programming skills. So the work of web developpers focus mainly on making web applications.<\/p>\r\n\r\n\r\n\r\n<p>There three main technics to make a web applications :<\/p>\r\n\r\n\r\n\r\n<ul><li>Wenether a client requests a web page, the web server generates all the HTML, CSS and Javascript on the fly using a certain &#8220;code&#8221; and then send it to back to the client. This technic is called <strong>server-side-rendering <\/strong>because it&#8217;s up to the &#8220;code&#8221; in the server to decide what to render to the client. The generated web pages are called <strong>dynamic pages<\/strong> because they are dynamically generated from each request<\/li><li>Before being avaible in the web, the web server pre-generate, using some code, all the HTML CSS and Javascript for each requests it expect clients to make. Then for each request, it will only have to access specific generated files on it&#8217;s memory and send them back. This technic is called <strong>static site generation<\/strong> because the server already generated all the web pages before any request. The generated web pages are called <strong>static pages <\/strong>because after they have been generated they don&#8217;t change.<\/li><li>The server pre-generate a bunch of Javascript files using a code or the Javascipt has been directly written. The web server then returns a single HTML and a single CSS and the Javascript files. When client requests any web ressource at any path the web server send it once the HTML, CSS and the Javascript files. The Javascript will be in charge of manipulating the HTML to respond to the users interaction with the web page so that no other files needs to be sent. Of course the client still need to access data in the server but know it don&#8217;t need to request web pages  but only data from APIs. This technic is called <strong>client side rendering <\/strong>because it is up to the Javascript code in the browser to decide what to render. The web pages generated are called <strong>Single Page Application (SPA) <\/strong>because the server sent the full web application once and interaction is processed by the Javascript. No requests means no latency so the interaction with the web application feels like a it&#8217;s single native application like a mobile application or a desktop application. <\/li><\/ul>\r\n\r\n\r\n\r\n<p>We will further discuss the benefits and drawbacks of each different technics in this post. <\/p>\r\n\r\n\r\n\r\n<p>That&#8217;s it, we covered some basic knowledge of web development. Hope it helped you. In the next posts we will try to do projects to learn how to make web applications.<\/p>\r\n",
         "protected":false
      },
      "excerpt":{
         "rendered":"<p>Hello world, my name is Elias, i&#8217;m passionate about web development and science. I decided to create this blog to share some cool project that I did or will do. In this first post we will try to understand what&#8217;s the web to know that basics before jumping to making coding projects. The basics The&#8230;<\/p>\n",
         "protected":false
      },
      "author":2,
      "featured_media":0,
      "comment_status":"closed",
      "ping_status":"closed",
      "sticky":false,
      "template":"",
      "format":"standard",
      "meta":{
         "spay_email":""
      },
      "categories":[
         1
      ],
      "tags":[
         
      ],
      "jetpack_featured_media_url":"",
      "_links":{
         "self":[
            {
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/posts\/5"
            }
         ],
         "collection":[
            {
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/posts"
            }
         ],
         "about":[
            {
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/types\/post"
            }
         ],
         "author":[
            {
               "embeddable":true,
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/users\/2"
            }
         ],
         "replies":[
            {
               "embeddable":true,
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/comments?post=5"
            }
         ],
         "version-history":[
            {
               "count":5,
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/posts\/5\/revisions"
            }
         ],
         "predecessor-version":[
            {
               "id":76,
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/posts\/5\/revisions\/76"
            }
         ],
         "wp:attachment":[
            {
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/media?parent=5"
            }
         ],
         "wp:term":[
            {
               "taxonomy":"category",
               "embeddable":true,
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/categories?post=5"
            },
            {
               "taxonomy":"post_tag",
               "embeddable":true,
               "href":"https:\/\/eliashami.com\/wp-json\/wp\/v2\/tags?post=5"
            }
         ],
         "curies":[
            {
               "name":"wp",
               "href":"https:\/\/api.w.org\/{rel}",
               "templated":true
            }
         ]
      }
   }
]